package com.example.bot.Telegram_bot_take_it.utils;

public class Messages {
    public static final String HELP_TEXT = """
            По всем вопросам обращаться к @barysheva_ol\s
            Либо звонить по номеру телефону: +79930990947
            /start - команда для запуска бота или перезапуска бота.
            /menu - команда, которая отправит вам меню выбранной кондитерской.
            /photoMenu - фотография меню.
            /basket - команда для просмотра корзины.
            /orders - команда для просмотра для заказов
            """;

    public static final String ABOUT_US_TEXT = """
            TAKE_IT — это больше, чем просто  кондитерская!
            
            Вот уже более 10 лет мы радуем вас нежными десертами, удивительными тортами на ваши торжества, создавая незабываемые моменты 🩷
            Очень символично - ровно 4 года назад мы начали открывать пространства, где нам сейчас с вами так тепло встречаться 🫶🏻
            Мы гордимся тем, что стали для многих той самой точкой на карте, 📍 куда хочется возвращаться снова и снова\s
            
            Что же такое TAKE_IT? Это место для тех, кто ценит качество, вкус и удобство. Наша философия проста: подарить вам идеальный момент.
            
            Конечно, этому располагает уютная атмосфера кофейни. Мы хотим, чтобы каждый ваш визит был наполнен теплотой и ощущением заботы.
            Мы поддерживаем тренд на здоровую еду на протяжении всех лет нашей работы 👌
            Качество для нас не просто слово, это фундамент каждого нашего продукта.
            Мы очень любознательны и постоянно ищем новые вкусы, совершенствуем рецептуры, чтобы удивлять вас 💫
            
            Здесь, на просторах нашего канала, вы сможете самыми первыми узнавать о наших новостях, новинках и просто наслаждаться нашей эстетикой\s
            
            Приходите к нам за порцией вдохновения и безупречного вкуса – мы всегда рады видеть вас! 🌟
            
            информация\s
            
            наш адрес
            📍Проспект Врача Сурова, 36\s
            
            режим работы
            🔘 Ежедневно с 10.00-21.00
            
            сделать заказ\s
            📞+7 993 099 0947
            """;

    public static final String MENU = "🍽️ Меню";
    public static final String MENU_LOWERCASE = "🍽️ меню";
}
